emacs-conf-programming.el
;; (if (string-equal system-type "windows-nt")
;;     (progn
;;       (add-to-list 'exec-path "C:/tools/apache-maven-3.6.0/bin")
;;       ))

;; perl
;; (if (string-equal system-type "windows-nt")
;;     (progn
;;       (add-to-list 'exec-path (concat emacs-home "/misc/lang/perl/strawberry-perl-5.28.0.1-64bit-portable/perl/bin"))
;;       ))

;;(add-hook 'prog-mode-hook 'linum-mode)
(add-hook 'prog-mode-hook 'hl-line-mode)
(add-hook 'prog-mode-hook 'clean-aindent-mode)

(setq css-indent-offset 2)

;; Garbage Collection  (100MB)
(setq gc-cons-threshold 104857600)

(defun eval-region-or-buffer ()
  (interactive)
  (let ((debug-on-error t))
    (cond
     (mark-active
      (call-interactively 'eval-region)
      (message "Region evaluated!")
      (setq deactivate-mark t))
     (t
      (eval-buffer)
      (message "Buffer evaluated!")))))

(add-hook 'emacs-lisp-mode-hook
          (lambda ()
            (local-set-key (kbd "C-x C-E") 'eval-region-or-buffer)))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PACKAGE : dumb jump
;;
;; Dumb Jump is an Emacs "jump to definition" package with support
;; for 40+ programming languages that favors "just working". 
;;
;; SITE    : https://github.com/jacktasia/dumb-jump
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(use-package dumb-jump
  :ensure t
  :bind
  (("M-g o" . dumb-jump-go-other-window)
   ("M-g j" . dumb-jump-go)
   ("M-g b" . dumb-jump-back)
   ("M-g i" . dumb-jump-go-prompt)
   ("M-g x" . dumb-jump-go-prefer-external)
   ("M-g z" . dumb-jump-go-prefer-external-other-window)
   )
  :config
  (setq dumb-jump-selector 'ivy)
  )

(use-package flycheck
  :ensure t
  )

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PACKAGE : origami
;;
;; A text folding minor mode for Emacs.
;;
;; To some degree, yes. Currently out of the box support is provided for:
;; - C
;; - C++
;; - Clojure
;; - Go
;; - Java
;; - Javascript
;; - PHP
;; - Perl
;; - Python
;; - elisp
;;
;; SITE    : https://github.com/gregsexton/origami.el
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(use-package origami
  :ensure t
  :custom
  (origami-show-fold-header t)
  :custom-face
  (origami-fold-replacement-face ((t (:inherit magit-diff-context-highlight))))
  (origami-fold-fringe-face ((t (:inherit magit-diff-context-highlight))))
  :init
  (defhydra origami-hydra (:color blue :hint none)
    "
      _:_: recursively toggle node       _a_: toggle all nodes    _t_: toggle node
      _o_: show only current node        _u_: undo                _r_: redo
      _R_: reset
      "
    (":" origami-recursively-toggle-node)
    ("a" origami-toggle-all-nodes)
    ("t" origami-toggle-node)
    ("o" origami-show-only-node)
    ("u" origami-undo)
    ("r" origami-redo)
    ("R" origami-reset)
    )
  :bind
  (:map origami-mode-map ("C-M-:" . origami-hydra/body))
  :config
  (face-spec-reset-face 'origami-fold-header-face)
  )

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PACKAGE : company
;;
;; GROUP   :
;; SITE    : https://github.com/iquiw/company-restclient
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(use-package company
  :ensure t
  :hook (scala-mode . company-mode)
  :config
  (setq lsp-completion-provider :capf)
  ;;(add-hook 'after-init-hook 'global-company-mode)
  ;;(global-set-key "\t" 'company-complete-common)
  ;; (global-set-key (kbd "C-<tab>") 'company-complete-common)

  (define-key company-mode-map (kbd "C-c \\") 'company-complete)
  (define-key company-mode-map (kbd "C-c |") 'company-complete-common)

  ;; (add-hook 'ielm-mode-hook 'company-mode)
  (add-hook 'ielm-mode-hook 'company-mode)
  (add-hook 'ielm-mode-hook (lambda () (push 'company-elisp company-backends)))
  (add-hook 'lisp-interaction-mode-hook 'company-mode)
  (add-hook 'lisp-interaction-mode-hook (lambda () (push 'company-elisp company-backends)))
  (add-hook 'emacs-lisp-mode-hook 'company-mode)
  (add-hook 'emacs-lisp-mode-hook (lambda () (push 'company-elisp company-backends))))

(use-package lsp-mode
  :ensure t
  :hook
  (lsp-mode . lsp-enable-which-key-integration)
  (java-mode . #'lsp-deferred)
  :init
  (setq
   lsp-keymap-prefix "C-c l"
   lsp-enable-file-watchers nil
   read-process-output-max (* 1024 1024)
   lsp-completion-provider :capf
   lsp-idle-delay 0.500
   ;;lsp-eldoc-render-all nil
   ;;lsp-highlight-symbol-at-point nil
   )
  :config
  (setq lsp-intelephense-multi-root nil)
  (with-eval-after-load 'lsp-intelephense
    (setf (lsp--client-multi-root (gethash 'iph lsp-clients)) nil))
  (define-key lsp-mode-map (kbd "C-c l") lsp-command-map)
  )

(use-package lsp-ui
  :ensure t
  :after (lsp-mode)
  :bind
  (:map lsp-ui-mode-map
        ([remap xref-find-definitions] . lsp-ui-peek-find-definitions)
        ([remap xref-find-references] . lsp-ui-peek-find-references)
        )
  :init
  (setq
   lsp-ui-doc-delay 1.5
   lsp-ui-doc-position 'bottom
   lsp-ui-doc-max-width 100
   )
  ;;  :config
  ;;(define-key lsp-ui-mode-map [remap xref-find-definitions] #'lsp-ui-peek-find-definitions)
  ;;(define-key lsp-ui-mode-map [remap xref-find-references] #'lsp-ui-peek-find-references)
  ;; (lsp-ui-peek-find-workspace-symbol "pattern 0")
  ;; If the server supports custom cross references
  ;; (lsp-ui-peek-find-custom 'base "$cquery/base")
  ;;  (setq lsp-ui-doc-enable nil)
  ;;  (setq lsp-ui-sideline-enable nil)
  ;;  (setq lsp-ui-flycheck-enable t)
  )

(use-package yaml-mode
  :ensure t
  :mode (".yaml$")
  :config
  (add-to-list 'auto-mode-alist '("\\.yml\\'" . yaml-mode))
  (add-to-list 'auto-mode-alist '("\\.yaml\\'" . yaml-mode))
  )

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PACKAGE : flycheck-gradle
;;
;; Flycheck extension for gradle projects.
;;
;; SITE    : https://github.com/jojojames/flycheck-gradle
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(use-package flycheck-gradle
  :ensure t
  :commands (flycheck-gradle-setup)
  :init
  (mapc
   (lambda (x)
     (add-hook x #'flycheck-gradle-setup))
   '(java-mode-hook kotlin-mode-hook)))

;; (use-package flycheck-gradle
;;   :ensure t
;;   :commands (flycheck-gradle-setup)
;;   :init
;;   (mapc
;;    (lambda (x)
;;      (add-hook x #'flycheck-gradle-setup ))
;;    ;; '(java-mode-hook kotlin-mode-hook)
;;    )
;;   )


;; (if (string-equal system-type "windows-nt")
;;     (progn
;;       (add-to-list 'exec-path "C:/tools/apache-maven-3.6.0/bin")
;;       ))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
