emacs-conf-programming.org
*** cmake-ide                                                     :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : cmake-ide
  ;;
  ;; cmake-ide is a package to enable IDE-like features on Emacs for CMake projects
  ;;
  ;; SITE    : https://github.com/atilaneves/cmake-ide
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (use-package cmake-ide
    :ensure t
    :config
    (cmake-ide-setup)
    )
#+end_src

** Html/JSP

*** web-mode                                                      :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : web-mode
  ;;
  ;; GROUP   : Programming
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (use-package web-mode
    :ensure t
    :config
    ;; (setq web-mode-tag-auto-close-style 0)
    (setq web-mode-markup-indent-offset 2)    ; 태그 들여쓰기
    (setq web-mode-css-indent-offset 2)       ; css 들여쓰기
    (setq web-mode-code-indent-offset 2)      ; 스타일, 스크립트 들여쓰기
    (setq web-mode-style-padding 1)           ; 스타일 패딩
    (setq web-mode-script-padding 1)          ; 스크립트 패딩
    (setq web-mode-block-padding 0)           ; 블록 패딩
    (setq web-mode-comment-style 2)           ; 주석 스타일
    (setq web-mode-enable-auto-pairing t)     ; 자동 짝 만들기
    (setq web-mode-enable-css-colorization t) ; css 컬러링
    (setq web-mode-enable-auto-indentation nil) ; 자동 인덴트 취소

    ;;(add-to-list 'web-mode-indentation-params '"lineup-args" . nil))
    ;;(add-to-list 'web-mode-indentation-params '"lineup-calls" . nil))
    ;;(add-to-list 'web-mode-indentation-params '"lineup-concats" . nil))
    ;;(add-to-list 'web-mode-indentation-params '"lineup-ternary" . nil))

    (add-to-list 'auto-mode-alist '("\\.html\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.hbs\\'" . web-mode))

    ;;(setq auto-mode-alist
    ;;      (append '(
    ;;                ("\\.\\(html\\|xhtml\\|shtml\\|tpl\\)\\'" . web-mode)
    ;;                ("\\.\\(php\\|phtml\\)\\'" . php-mode)
    ;;                )
    ;;              auto-mode-alist))
    ;; 라인 wrapping 설정
    (add-hook 'web-mode-hook 'toggle-truncate-lines nil)
    (add-hook 'web-mode-hook 'visual-line-mode nil)
    )
#+end_src

*** emmet                                                         :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : emmet-mode
  ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (use-package emmet-mode
    :ensure t
    :config
    (add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
    (add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.
    (add-hook 'web-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.

    (add-hook 'emmet-mode-hook
              (lambda()
                (define-key emmet-mode-keymap (kbd "C-j") nil)
                (define-key emmet-mode-keymap (kbd "C-M-j") 'emmet-expand-line)
                (define-key emmet-mode-keymap (kbd "C-M-;") 'emmet-expand-line)
                (define-key emmet-mode-keymap (kbd "<M-left>") 'emmet-prev-edit-point)
                (define-key emmet-mode-keymap (kbd "<M-right>") 'emmet-next-edit-point)
                ))

                                          ;(setq emmet-preview-default nil)
                                          ;(setq emmet-move-cursor-between-quotes t)
    )
#+end_src

** Perl

#+begin_src emacs-lisp
  ;; perl
  ;; (if (string-equal system-type "windows-nt")
  ;;     (progn
  ;;       (add-to-list 'exec-path (concat emacs-home "/misc/lang/perl/strawberry-perl-5.28.0.1-64bit-portable/perl/bin"))
  ;;       ))
#+end_src

*** cperl-mode                                                    :package:

#+begin_src
  (use-package cperl-mode
    :ensure t
    :config
    (defalias 'perl-mode 'cperl-mode)
    (add-to-list 'auto-mode-alist '("\\.\\([pP][L|m]\\||psgi\\|t\\)\\'" . cperl-mode))
    (add-hook 'cperl-mode-hook (lambda () (flymake-mode t)))

    ;; for plenv user
    (defun flymake-perl-init ()
      (let* ((temp-file (flymake-init-create-temp-buffer-copy
                         'flymake-create-temp-with-folder-structure))
             (local-file (file-relative-name
                          temp-file
                          (file-name-directory buffer-file-name))))
        (list (guess-plenv-perl-path) (list "-wc" local-file))))

    ;; for perlbrew user
    (defun flymake-perl-init ()
      (let* ((temp-file (flymake-init-create-temp-buffer-copy
                         'flymake-create-temp-inplace))
             (local-file (file-relative-name
                          temp-file
                          (file-name-directory buffer-file-name))))
        (list (perlbrew-mini-get-current-perl-path)
              (list "-MProject::Libs" "-wc" local-file))))
    )
#+end_src

*** helm-perldoc                                                  :package:

#+begin_src
  (use-package helm-perldoc
    :ensure t
    :config
    (eval-after-load "cperl-mode"
      '(progn
         (helm-perldoc:setup)))
    (add-hook 'cperl-mode-hook 'helm-perldoc:carton-setup)
    )
#+end_src
  
** Javascript

*** js2-mode                                                      :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : js2
  ;;
  ;; GROUP   : Programming
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (use-package js2-mode
    :ensure t
    :config
    (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
    (add-hook 'js2-mode-hook 'toggle-truncate-lines nil)
    )
#+end_src

*** rjsx-mode                                                     :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : rjsx-mode
  ;;
  ;; This mode derives from js2-jsx-mode, extending tis parser to support JXS syntax according
  ;; to the official spec.
  ;;
  ;; SITE    : https://github.com/felipeochoa/rjsx-mode
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (use-package rjsx-mode
    :ensure t
    :config
    (add-to-list 'auto-mode-alist '("components\\/.*\\.js\\'" . rjsx-mode))
    )
#+end_src

*** tern                                                          :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : tern
  ;;
  ;; GROUP   : Programming
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (use-package tern
    :ensure t
    :config
    (add-hook 'js2-mode-hook (lambda () (tern-mode t)))
    (add-hook 'web-mode-hook (lambda () (tern-mode t)))
    )

  (use-package tern-auto-complete
    :ensure t
    :config
    (add-hook 'js2-mode-hook (lambda () (auto-complete-mode)))
    (add-hook 'web-mode-hook (lambda () (auto-complete-mode)))
    (eval-after-load 'tern
      '(progn
         (require 'tern-auto-complete)
         (setq tern-ac-on-dot t)
         (tern-ac-setup)))
    )
#+end_src

*** vue-mode                                                      :package:

- vue3 :: npm install -g @vue/language-server
- vue2 :: npm install -g vls

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : vue-mode
  ;;
  ;; SITE : https://github.com/AdamNiederer/vue-mode
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (use-package vue-mode
    :ensure t
    :config
    (setq indent-tabs-mode nil
          js-indent-level 2)
    (add-hook 'vue-mode-hook #'lsp)
    )
#+end_src

*** pug-mode                                                      :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : pug-mode
  ;;
  ;; SITE : https://github.com/hlissner/emacs-pug-mode
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (use-package pug-mode
    :ensure t
    :config
    (setq pug-tab-width 2)
    )
#+end_src

*** jade-mode                                                     :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : jade-mode
  ;;
  ;; SITE : https://github.com/brianc/jade-mode
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (use-package jade-mode
    :ensure t
    )
#+end_src

