emacs-conf-programming.org
*** typescript-mode                                               :package:

- SITE :: https://github.com/emacs-typescript/typescript.el

LSP 모드를 통해 세팅하려면 아래 설정을 추가 해줘야 함 (https://emacs-lsp.github.io/lsp-mode/page/lsp-typescript/)

#+begin_src sh
  $ npm i -g typescript-language-server
  $ npm i -g typescript
#+end_src

#+begin_src emacs-lisp
  (use-package typescript-mode
    :ensure t
    :config
    (setq typescript-indent-level 2)
    (add-hook 'typescript-mode-hook #'lsp)
    ;;(add-to-list 'auto-mode-alist '("\\.vue\\'" . typescript-mode))
    ;;(setq auto-mode-alist (delete '("\\.vue\\'" . typescript-mode) auto-mode-alist))
    )
#+end_src

*** lsp tailwindcss

- SITE :: https://github.com/merrickluo/lsp-tailwindcss

  #+begin_src
    (use-package lsp-tailwindcss
      :ensure t
      :init
      (setq lsp-tailwindcss-add-on-mode t)
      )
  #+end_src

*** ob-typescript

- SITE :: https://github.com/lurdan/ob-typescript

#+begin_src emacs-lisp
  (use-package ob-typescript
    :ensure t
    :config
    (setq org-babel-command:typescript "npx -p typescript -- tsc")
    )
#+end_src

*** vue-ts-mode                                                   :package:

- SITE :: https://github.com/8uff3r/vue-ts-mode

#+begin_src
  (use-package vue-ts-mode
    :ensure t
    )
#+end_src

#+RESULTS:
: t


*** tide                                                          :package:

#+begin_src
  (use-package tide
    :ensure t
    :after (typescript-mode company flycheck)
    :hook ((typescript-mode . tide-setup)
           (typescript-mode . tide-hl-identifier-mode)
           (before-save . tide-format-before-save)))
#+end_src

** Java

#+begin_src
  (org-babel-load-file "d:/gdrive/tools/emacs/emacs-29.1_2/emacs-conf/emacs-conf-prog-java.org")
#+end_src

#+RESULTS:
: Loaded d:/gdrive/tools/emacs/emacs-29.1_2/emacs-conf/emacs-conf-prog-java.el

** PHP 

*** php-mode                                                      :package:

#+begin_src
  (use-package php-mode
    :ensure t)

  ;; (add-hook 'php-mode-hook
  ;;           '(lambda ()
  ;;              (auto-complete-mode t)
  ;;              (require 'ac-php)
  ;;              (setq ac-sources  '(ac-source-php ) )
  ;;              (yas-global-mode 1)

  ;;              (ac-php-core-eldoc-setup ) ;; enable eldoc
  ;;              (define-key php-mode-map  (kbd "C-]") 'ac-php-find-symbol-at-point)   ;goto define
  ;;              (define-key php-mode-map  (kbd "C-t") 'ac-php-location-stack-back)    ;go back
  ;;              ))
#+end_src

*** ac-php-core                                                   :package:

#+begin_src emacs-lisp
  (use-package ac-php-core
    :ensure t)
#+end_src

*** php-eldoc                                                     :package:

#+begin_src
  (use-package php-eldoc
    :ensure t
    :config
    (ac-php-core-eldoc-setup) ;; enable eldoc
    )
#+end_src

*** company-php                                                   :package:

#+begin_src
  (use-package company-php
    :ensure t
    :config
    (add-hook 'php-mode-hook
              '(lambda ()
                 (require 'company-php)
                 (company-mode t)
                 (make-local-variable 'company-backends)
                 (add-to-list 'company-backends 'company-ac-php-backend)))
    )
#+end_src

*** flymake-php                                                   :package:

#+begin_src
  (use-package flymake-php
    :ensure t)
#+end_src

** Clojure

#+begin_src
  (use-package cider
    :ensure t
    )
#+end_src

** SQL

*** ejc-sql                                                       :package:

#+begin_src
  (use-package ejc-sql
    :ensure t
    :config
    (add-hook 'ejc-sql-hook
              (lambda()
                ;; (setq cider-lein-parameters "repl :headless :host localhost")
                (ejc-set-rows-limit 1000)))
    )
#+end_src
  
*** sql-indent                                                    :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : sql-indent
  ;;
  ;; sql-indent.el is a GNU Emacs minor mode which adds support for syntax-based indentation
  ;; when editing SQL code: TAB indents the current line based on the syntax of the SQL code on previous lines.
  ;; This works like the indentation for C and C++ code.
  ;;
  ;; SITE    : https://github.com/alex-hhh/emacs-sql-indent
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (use-package sql-indent
    :ensure t
    )
#+end_src

** Groovy

*** groovy-mode                                                   :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : groovy-mode
  ;;
  ;;
  ;;
  ;; SITE    :
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (use-package groovy-mode
    :ensure t
    )
#+end_src

** COMMON-LISP

*** slime                                                         :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : slime
  ;;
  ;; SLIME is the Superior Lisp Interaction Mode for Emacs.
  ;;
  ;; SITE    : https://github.com/slime/slime
  ;;           https://common-lisp.net/project/slime/
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (use-package slime
    :ensure t
    :commands slime
    :init
    (setq inferior-lisp-program (or (executable-find "sbcl")
                                    (executable-find "/usr/bin/sbcl")
                                    (executable-find "/usr/local/bin/sbcl")
                                    "sbcl"
                                    ))
    :config
    (require 'slime-autoloads)
    (slime-setup '(slime-fancy))
    (add-hook 'slime-repl-mode-hook (lambda() (paredit-mode t)))
    )
#+end_src
  
** ELISP

*** ctable                                                        :package:

#+begin_src
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : ctable
  ;;
  ;; ctable.el is a table component for emacs lisp
  ;;
  ;; SITE    : https://github.com/kiwanami/emacs-ctable
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (use-package ctable
    :ensure t
    )
#+end_src

** Python

*** elpy                                                          :package:

#+begin_src
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : elpy
  ;;
  ;; Elpy is an Emacs package to bring powerful Python editing to Emacs.
  ;;
  ;; SITE    : https://github.com/jorgenschaefer/elpy
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (use-package elpy
    :ensure t
    :init
    (elpy-enable)
    )
#+end_src

*** blacken                                                       :package:

#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : blacken
  ;;
  ;; Use the python black package to reformat your python buffers.
  ;;
  ;; SITE    : https://github.com/pythonic-emacs/blacken
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (use-package blacken
    :ensure t
    )
#+end_src
  
** Coffee Script

*** coffee-mode                                                   :package:

#+begin_src
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : coffee-mode
  ;;
  ;; An Emacs major mode for CoffeeScript and IcedCoffeeScript.
  ;;
  ;; SITE    : https://github.com/defunkt/coffee-mode
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (use-package coffee-mode
    :ensure t
    )
#+end_src

** Visual Basic

*** vbasense                                                      :package:

#+begin_src
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : vbasense
  ;;
  ;; This is a extension of Emacs.
  ;;
  ;; SITE    : https://github.com/aki2o/emacs-vbasense
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (use-package vbasense
    :ensure t
    )
#+end_src

** Gradle

*** gralde-mode                                                   :package:

#+begin_src
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; PACKAGE : gradle-mode
  ;;
  ;; GROUP   :
  ;; SITE    : https://github.com/jacobono/emacs-gradle-mode
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (use-package gradle-mode
    :ensure t
    )
#+end_src

** CSS

#+begin_src emacs-lisp
  (setq css-indent-offset 2)
#+end_src
