emacs-conf-programming.el

(use-package typescript-mode
  :ensure t
  :config
  (setq typescript-indent-level 2)
  (add-hook 'typescript-mode-hook #'lsp)
  ;;(add-to-list 'auto-mode-alist '("\\.vue\\'" . typescript-mode))
  ;;(setq auto-mode-alist (delete '("\\.vue\\'" . typescript-mode) auto-mode-alist))
  )

(use-package ob-typescript
  :ensure t
  :config
  (setq org-babel-command:typescript "npx -p typescript -- tsc")
  )

(use-package ac-php-core
  :ensure t)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PACKAGE : sql-indent
;;
;; sql-indent.el is a GNU Emacs minor mode which adds support for syntax-based indentation
;; when editing SQL code: TAB indents the current line based on the syntax of the SQL code on previous lines.
;; This works like the indentation for C and C++ code.
;;
;; SITE    : https://github.com/alex-hhh/emacs-sql-indent
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(use-package sql-indent
  :ensure t
  )

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PACKAGE : groovy-mode
;;
;;
;;
;; SITE    :
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(use-package groovy-mode
  :ensure t
  )

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PACKAGE : slime
;;
;; SLIME is the Superior Lisp Interaction Mode for Emacs.
;;
;; SITE    : https://github.com/slime/slime
;;           https://common-lisp.net/project/slime/
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(use-package slime
  :ensure t
  :commands slime
  :init
  (setq inferior-lisp-program (or (executable-find "sbcl")
                                  (executable-find "/usr/bin/sbcl")
                                  (executable-find "/usr/local/bin/sbcl")
                                  "sbcl"
                                  ))
  :config
  (require 'slime-autoloads)
  (slime-setup '(slime-fancy))
  (add-hook 'slime-repl-mode-hook (lambda() (paredit-mode t)))
  )

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PACKAGE : blacken
;;
;; Use the python black package to reformat your python buffers.
;;
;; SITE    : https://github.com/pythonic-emacs/blacken
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
(use-package blacken
  :ensure t
  )

(setq css-indent-offset 2)
